{
    "etag": "8MHcNTxXwCdh97R_P5kP9cNjoTs",
    "items": [
        {
            "contentDetails": {
                "videoId": "89e518dl4I8",
                "videoPublishedAt": "2018-10-21T16:37:10Z"
            },
            "etag": "UbperTYDsrg1PU94MH7dc2HM-Ow",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC45NDk1REZENzhEMzU5MDQz",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect chest workout should consist of exercises for your upper chest muscles, middle chest muscles and lower chest muscles. But, even that doesn’t guarantee chest gains. In order to round out your pectoral muscles you need to fill in the gaps of what is lacking on those popular chest exercises.\n\n60% off all AX programs - http://athleanx.com/x/370-workouts\n\nSubscribe to this channel here - http://bit.ly/2b0coMW\n\nIf you look at the four main exercises that people do in their chest workouts you will see incline bench press, barbell bench press (done on a flat bench), dips and the regular push-up. Take a close look into each of these upper body movements and you will see one thing in common. They hit the primary muscles but lack a full shoulder adduction within the exercise.\n\nThis is a problem when it comes to developing chest muscle definition. Just because you are going through a full range of motion on the exercises that you are doing it does not mean that you are taking a muscle through its full range of motion. For instance, all chest exercises are performed by changing arm angle at the shoulder. Because the shoulder is a three dimensional ball and socket joint, you have a great deal of motion available to you on your chest exercises.\n\nThat said, with the hands being fixed on a barbell, dip station or the floor through most of the common chest exercises you are not able to take your shoulder through the full horizontal adduction that it is capable of going through. Due to this, there is limited activation of the pecs since they are built to take the arm fully across the body, over midline into a more complete adduction.\n\nThe key to growth for the chest muscles is to not forego the popular mass building chest exercises using heavier loads but add to them, in drop set fashion using a cable crossover machine and band training. Here is how to construct the perfect chest workout with that in mind.\n\n0:00 Intro\n\n4:20 Barbell Bench Press - 4 sets of 6,8,10,12 reps\n\n- Lie on a flat exercise bench taking an overhand grip on a bar loaded with heavy barbell plates, a slightly wider grip than hands shoulder width apart. Press upward and slowly lower the bar to the starting position. \n- Go immediately into a horizontal cable chest (on cable machine) or band crossover (with resistance bands) for 15 reps\n\n5:19 Incline Dumbbell Bench Presses - 4 sets of 6,8,10,12 reps\n\n\n- Set an incline bench to a 30 degree incline angle and sit holding a pair of dumbbells with an overhand grip. Press upward and slowly lower the pair of dumbbells to the starting position.\n- Go from incline presses immediately into a low to high cable (on cable machine) or band crossover (with resistance bands) for 15 reps\n\n6:00 Weighted Dips - 4 sets of 6,8,10,12 reps\n\n- Start in dip position on a dip apparatus. If desired you can add heavy barbell plates for extra resistance.  Lean forward slightly and bend the elbows to dip down and return to the starting position.\n- Go from dip position immediately into a high to low cable or band crossover for 15 reps\n\n6:24 Weighted Pushups - 3 sets to Failure\n\n- Starting position is in a strong plank position with hands stacked under shoulders with light to heavy barbell plates on your back. Lower down and then push back up in a fluid movement. \n- Immediately into a banded push-up sets for 15 reps with band on each arm\n\nFocus on the muscle fibers you are working as you move through each effective movement to improve your mind to muscle connection. This will afford you additional gains, muscle definition and chest growth potential. Keep your core tight the entire time to \n\nWhen you put this together in drop set format as I’m suggesting here, you not only now hit the chest through it’s full range of motion but you hit every area of the chest as well. The drop down allows for the less intense exercise to be more taxing since it was just preceded by a more difficult compound lift. This will help you achieve strength gains quicker and boost your muscle growth potential.\n\nThis perfect chest workout is just one example of how to apply science to your chest workout repertoire. If you want to train like an athlete you want to put science back in every workout you do. You can do that with the ATHLEAN-X Training Programs available at http://athleanx.com and get started right away on building a ripped, muscular, athletic body.\n\nFor more chest workout videos for the upper chest, lower chest and inner chest, whether you have access to a barbell, expensive cable setups, a pair of dumbbells, or just need bodyweight movements, be sure to subscribe to our channel here on youtube at  / jdcav24 and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 0,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "89e518dl4I8"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/89e518dl4I8/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/89e518dl4I8/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/89e518dl4I8/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/89e518dl4I8/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/89e518dl4I8/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Chest Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "gozU3CUIizs",
                "videoPublishedAt": "2018-10-28T17:48:09Z"
            },
            "etag": "HGEaJ8KbjJz4aaa9zg5Xll6R9tM",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC5DQUNERDQ2NkIzRUQxNTY1",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect biceps workout should consist of exercises that not only hit the long and short head but also the brachialis, a totally separate muscle. In addition, it must put the biceps through its full range of motion and utilize both the flexion of the elbow and the supination of the hand. That said, even that won’t complete your biceps workout! In order to round out your biceps you need to also include techniques that create unique stresses on the muscle giving it no choice but respond. That is what we do in this video.\n\n60% off all AX programs - http://athleanx.com/x/368-workouts\nSubscribe to this channel here - http://bit.ly/2b0coMW\n\nIf you look at the main exercises that people do in their biceps workouts you will see a lot of curls. After all, a major function of the biceps is to flex the elbow. \n\nThis is a problem when it comes to complete biceps development your biceps likely get plenty of activation during your back workout so in order to take your development to another level you need to include unique methods of stimulation. Just because you are going through a full range of motion on the exercises that you are doing and performing the major roles of the muscle 9elbow flexion and hand supination) it does not mean that you are giving the muscle sufficient stimulus to force growth. We all know guys who can do tons of pull ups and heavy rows but don’t have the greatest bicep development. \n\nThe solution to this problem is to not forego the popular mass building exercises, those are still the foundation of our training, but we also need to add specialization exercises and techniques. With that said, here what the perfect biceps workout would look like:\n\nCheat Curls - To Failure immediately into\nBarbell Drag Curl - To Failure\n\nPerform for 3 Sets\n\nWeighted Chins -  To Failure immediately into\nPulsed Contraction Chin Curls - To Failure\n\nPerform for 3 Sets\n\nIncline Dumbbell Curls - 3 sets to failure (Utilize the stretch reflex of the triceps technique)\n\nDumbbell Curl Trifecta -  2 sets of 8 on each arm for each exercise\n – Cross supination (Emphasizes the long head of the biceps)\n – Cross pronation (Emphasizes the brachialis )\n – No Money curls (Emphasizes the short head of the biceps)\n\nWhen you put this together in as I’m suggesting here, you not only now hit the biceps through it’s full range of motion but you hit every area of the biceps as well and in a fashion they’re not likely grown accustom to. Advanced techniques allows for a more intense sets which are obviously more taxing pair that with the difficult compound lifts and you have an excellent workout.\n\nThis is just one example of how to apply science to your training. If you want to train like an athlete you want to put science back in every workout you do. You can do that with the ATHLEAN-X Training Programs available at http://athleanx.com and get started right away on building a ripped, muscular, athletic body.\n\nFor more biceps workout videos be sure to subscribe to our channel here on youtube at http://youtube.com/user/jdcav24 and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 1,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "gozU3CUIizs"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/gozU3CUIizs/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/gozU3CUIizs/hqdefault.jpg",
                        "width": 480
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/gozU3CUIizs/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/gozU3CUIizs/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Biceps Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "jv31A4Ab4nA",
                "videoPublishedAt": "2018-11-04T18:04:06Z"
            },
            "etag": "JeHgo-SPsMO1Xv9pkjZofJEMB2I",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC41MzJCQjBCNDIyRkJDN0VD",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect shoulder workout should consist of exercises for your front delts, middle delts and rear delts (not necessarily in that order!). That said, even that doesn’t make the shoulder workout complete.  In order to round out your shoulders with a well rounded workout you need to fill in the gaps of what is lacking on those popular shoulder exercises.  That is what we do in this video.\n\n60% off all AX programs - http://athleanx.com/x/2-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nIf you look at the four main exercises that people do in their shoulders workout you will see barbell or dumbbell overhead press, side lateral raises, front delt raises and maybe even dips.  Take a close look into each of these classic movements and you will see one thing in common.  That is, each of these exercises is lacking either a stretch position of the shoulder or doesn’t take the muscle through it’s full available range of motion.\n\nThis is a problem when it comes to developing a complete set of impressive shoulders.  Just because you are going through a full range of motion on the exercises that you are doing it does not mean that you are taking a muscle through its full range of motion.  For instance, all shoulder exercises are performed by changing the angle of the arm at the shoulder.  Because the shoulder is a three dimensional ball and socket joint, you have a great deal of motion available to you on your shoulder exercises.\n\nThat said, we often overlook the fact that the shoulder joint is not just this ball and socket.  Because the socket is technically the shoulder blade, you have to consider all of the other muscles that are connected to these bones that then play an important role in shoulder training.  Not just that, but hypertophy should never be the only goal of your shoulder workouts.  In order to be complete like an athlete you are going to have to incorporate some movements that train the explosiveness of the entire shoulder girdle and let you train all of these muscles together.\n\nThe solution to this problem is to not forego the popular mass building shoulder exercises or even the lighter ones geared at mass but add to them, and overlook no element of complete training.  Here is how to construct the perfect shoulder workout with that in mind.\n\nWarmup with Overhead Banded Press - 2 sets of 15 with 3 second holds each rep.\n\nOHP or Handstand pushups - 4 sets of 12,8,6,6 reps\nFinish with one set of dumbbell and band overhead presses for neuromuscular re-education x 15 reps\n\nDelt Stretch Tri-Set (21’s) - 2-3 sets of 7 reps in each direction for rear, middle and front delts\nMake sure you perform these in the order of rear to front to account for fatigue.\n\nDB Cheat Laterals - 3 sets to failure on each arm\nImmediately into a DB Push Press to failure on each arm\n\nCable or Banded Face Pulls - 3 sets of 15\nPerform these with a mindset of 15 sets of 1 to ensure highest quality of every rep.\n\nWhen you put this together in the format as I’m suggesting here, you not only now hit the shoulders through their full range of motion but you hit every area of the shoulders as well.  The drop down allows for the lesser intense exercise to be more taxing since it was just preceded by a more difficult compound lift.\n\nThis is just one example of how to apply science to your shoulder workouts.  If you want to train like an athlete you want to put science back in every workout you do.  You can do that with the ATHLEAN-X Training Programs available at the link below and get started right away on building a ripped, muscular, athletic body.\n\nFor more shoulder workout videos for the front deltoids, middle delts and rear delts, be sure to subscribe to our channel here on youtube at http://youtube.com/user/jdcav24 and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 2,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "jv31A4Ab4nA"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/jv31A4Ab4nA/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/jv31A4Ab4nA/hqdefault.jpg",
                        "width": 480
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/jv31A4Ab4nA/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/jv31A4Ab4nA/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Shoulder Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "tMyFe-IL7Ks",
                "videoPublishedAt": "2018-11-18T18:19:01Z"
            },
            "etag": "pwplr3utCNwak-mytxgI5C3u3vE",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC4xMkVGQjNCMUM1N0RFNEUx",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect triceps workout should consist of exercises for the lateral head, medial head and long head of the tricep muscle.  That said, even that doesn’t make the triceps workout complete.  In order to round out your arms with a well rounded workout you need to fill in the gaps of what is lacking on those popular triceps exercises and put science back in your training.  That is what we do in this video.\n\n60% off all AX programs - http://athleanx.com/x/6-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nIf you look at the four main exercises that people do in their triceps workouts you will see dips, close grip bench presses, pushdowns and lying dumbbell extensions or skullcrushers.  Take a close look into each of these classic movements and you will see one thing in common.  That is, each of these exercises is adept at hitting some portion of the triceps through a specific part of their range of motion but none of them hits them completely.\n\nThis is a problem when it comes to developing a complete triceps.  Just because you are going through a full range of motion on the exercises that you are doing it does not mean that you are taking a muscle through its full range of motion.  For instance, only those triceps exercises that change the angle of the arm at the shoulder will have a secondary influence on the long head of the triceps given it’s attachment on the shoulder blade.  The lateral and medial heads of the triceps originate on the humerus and cross the elbow joint only limiting their influence to elbow extension only.\n\nThat said, in order to fully work the triceps muscle in your workout you want to be sure that you are including exercises that hit the long head.  But it goes even further than this.  You can’t just hit it with exercises that place your arm over your head (to supposedly increase the stretch reflex on the triceps) but you also must take into consideration that you want to fully shorten the muscle by placing the arm back into extension behind your body as well.\n\nThis is in addition of course to wanting to make sure that you look into the science of strength curves when it comes to triceps training.  Just as you could do with the banded dumbbell curl in our perfect biceps workout, you can do the same with triceps.  Exploring exercises that overlap strength curves for the triceps will help you to construct a workout that is great at developing your tricep muscles maximally.\n\nFinally, as is always the case when trying to build muscle, you will not want to forego the popular mass building triceps exercises but add to them, with drop sets and partials.  Here is how to construct the perfect triceps workout with that in mind.\n\nClose Grip Pin Press - 3 sets of 10,6,4 reps\nChoose a weight that allows you to reach failure in each rep range\n\nWeighted Dip Tri-Set - 3 sets to failure in each position\nImmediately drop from weighted dips to bodyweight to assisted.  No rest in between failures.\n\nTricep Pushaways into Drag Pushdowns - 3 sets with 12 RM on first exercise to failure\nImmediately into the pushdowns without changing the weight.\n\nRocking Pushdowns - 2 sets to Failure using 12RM\n\nBanded Lying Tricep Extensions - 2 sets to Failure using 15RM\n\nWhen you put this together in the format as I’m suggesting here, you not only now hit the triceps through its full range of motion but you hit every area of the tricep muscle as well.  The drop down allows for the lesser intense exercise to be more taxing since it was just preceded by a more difficult compound lift.\n\nThis is just one example of how to apply science to your tricep workouts.  If you want to train like an athlete you want to put science back in every workout you do.  You can do that with the ATHLEAN-X Training Programs available at http://athleanx.com or click the link below and get started right away on building a ripped, muscular, athletic body.\n\nFor more tricep workout videos for the lateral head, medial head and long head of the triceps, be sure to subscribe to our channel here on youtube at the link below and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 3,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "tMyFe-IL7Ks"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/tMyFe-IL7Ks/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/tMyFe-IL7Ks/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/tMyFe-IL7Ks/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/tMyFe-IL7Ks/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/tMyFe-IL7Ks/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Triceps Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "4EkKhkSNjWY",
                "videoPublishedAt": "2018-12-09T17:12:24Z"
            },
            "etag": "n_UBCsJDVmou_A9uOyt9Zwkt8V4",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC4wOTA3OTZBNzVEMTUzOTMy",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect forearm workout should consist of exercises for not just wrist extension and flexion but other important forearm actions as well.  That said, even that doesn’t make the forearm workout complete.  In order to round out your forearms with a well rounded workout you need to fill in the gaps of what is lacking on those popular forearm exercises and put science back in your training.  That is what we do in this video.\n\n60% off all AX programs - http://athleanx.com/x/12-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nThe problem with wrist curls and extensions isn’t just that they train simply a fraction of what the forearms are capable of but also in that many people do these two exercises incorrectly.  For instance, if you look at the wrist curls for the palm side of your forearms you will see two major errors in performing them either with your elbows rested on a bench or standing with the bar in front of your thighs.  \n\nFirst, the gravity loaded nature of both will tend to push the bar further into the fingers as you fatigue.  This is very problematic given that we have already identified in great detail how the strain on the distal finger tendons is one of the most common causes of medial elbow tendonitis and flare ups.  The second major issue, particularly in the standing curl variation, is the tendency of the biceps to want to contribute to the curl and take over for the forearms.  This will result in an understimulated and underdeveloped forearm muscle.\n\nInstead, you will want to turn your hand over and perform the prone wrist curl shown in the video.  The advantages of this are not only that they eliminate the contribution of the biceps to the exercise but it also prevents strain on the elbow.  Remember, forearm work is often done multiple times per week given their high tolerance to volume and predominance of slow twitch muscle fibers.  Accumulating high volume in a compromised setup will be magnified here and must be avoided.\n\nIn between all sets of this perfect forearm workout you are going to do one of the best slow twitch forearm muscle activators - the farmers carry.  Grab a pair of heavier dumbbells and walk one lap around the gym back to the starting point to perform your second and final set of each exercise.  If you are just starting out you can perform just one carry per exercise when you are splitting up right and left sides to ease into the overall volume.\n\nNext you want to perform your reverse wrist extensions for the top sides of your forearms standing as well.  This is because when performed on the edge of a bench you often times will remove the tension from the forearms in the peak contracted state (not what you want to do if you are trying to build bigger forearms).  When done in standing, I prefer to do them as a reverse wrist roll for time paired up in ladder style with a reverse barbell curl to hit the brachioradialis (another prominent muscle in the forearm).\n\nA complete forearm workout will also not forget to include exercises for radial and ulnar deviation as well as supination and pronation to hit all of the key functions of the area.  Deep finger flexors are also integrated to be sure not to overlook the importance these muscles play on the overall size of the forearm given all of their muscle bellies lie within the forearm itself.\n\nHere is how to construct the perfect forearm workout:\n\n1.  PRONE WRIST CURLS - 2 x 12-15RM **\n\n2.  WRIST CURL LADDER - 2 x LADDER FAILURE **\n     A.  REVERSE WRIST ROLLS x 1,2,3,4, etc seconds\n     B.  REVERSE BARBELL CURLS x 1,2,3,4 etc reps\n\n3.  RADIAL / ULNAR DEVIATION - 2 x 12-15RM **\n\n4.  SUPINATION / PRONATION - 2 x 12-15RM **\n\n5.  CLIP GRIP COMBO - 2 x SUPERSET TO FAILURE **\n     A.  CLIP SQUEEZES TO FAILURE\n     B.  CLIP SQUEEZE WRIST ROCKS TO FAILURE\n\n6.  DEAD ARM HANG BURNOUT x 1 MINUTE\n\nWhen you put this together in the format as I’m suggesting here, you not only now hit the forearms through their full range of motion but you hit every function of the this multi joint influenced muscle group as well.  The supersets and ladders allow for an intensification of the workout to ensure that you are creating enough overload to spark growth in these muscles.\n\nThis is just one example of how to apply science to your forearm workouts.  If you want to train like an athlete you want to put science back in every workout you do.  You can do that with the ATHLEAN-X Training Programs available at http://athleanx.com or click the link below and get started right away on building a ripped, muscular, athletic body.\n\nFor more forearm workout videos that also hit the brachioradialis and help to build bigger arms, be sure to subscribe to our channel here on youtube at the link below and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 4,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "4EkKhkSNjWY"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/4EkKhkSNjWY/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/4EkKhkSNjWY/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/4EkKhkSNjWY/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/4EkKhkSNjWY/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/4EkKhkSNjWY/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Forearm Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "eE7dzM0iexc",
                "videoPublishedAt": "2019-02-17T18:16:42Z"
            },
            "etag": "cpLSuNuoAHG6l6QxpGz_UnJA1Ok",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC41MjE1MkI0OTQ2QzJGNzNG",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect back workout should consist of exercises for not just the lats and traps but other important muscles of the back as well.  That said, even that doesn’t make the back workout complete.  In order to round out your back with a well rounded workout you need to fill in the gaps of what is lacking on those popular back exercises and put science back in your training.  That is what we do in this video.\n\n60% off all AX programs - http://athleanx.com/x/31-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nThe problem with lat focused training isn’t just that it trains simply a fraction of what the back muscles are capable of but also that many people choose repetitive exercises that work the back in the same plane.  For instance, if you look at the pullup and lat pulldown you will see two major vertical pulling exercises that while not bad to perform in the same back workout, overlook the importance of horizontal pulling if nothing else is done.\n\nIt goes beyond this however.  Even when you perform the pullup, many will look at it as a high rep bodyweight exercise only.  They overlook how powerful the movement can be when loaded up with additional weight as in a weighted chin up.  This can become a tremendous compound exercise option and one that is capable of building a lot of back strength, size and overall gains.  Additionally, getting locked in on one grip during this exercise is costing you the chance to work other areas of the back such as the teres major (which in and of itself occupies a large amount of mass above the lats) and therefore limiting the gains you will see from your workout.\n\nInstead, you will want to be sure to mix up chins and pullups along with a foundational strength exercise for the back like the deadlift to start your workout off right.  The deadlift has the ability to work many of the areas of the back all in one shot.  The traps, lats, and lower back all get a heavy dose of overload on this powerhouse of a back exercise.  If you load it heavy enough and refuse to sacrifice your form, this can be an enormous benefit to your overall back development.\n\nWe also have an opportunity to introduce some straight arm pushdowns with each warmup set of deadlifts.  This helps to ingrain one of the most important movement patterns you will need to not only perform the deadlift but all next level back exercises.  \n\nAs you make your way through the workout however you also don’t want to miss the chance to train explosively.  When you train like an athlete you always want to speed up what you slow down with your heavier weight training. The barbell dead row is a perfect example of this.  Perform this powerful back exercise as a follow up to the deadlift and you will find that even a heavier weight seems lighter and more able to be accelerated.\n\nNo perfect back workout would be complete without some additional focused tension towards the lats.  This allows you to develop that mind muscle connection that is important for maximizing hypertrophy of the back.  Choose between one of the two exercises listed and only do one of them.  Just focus on really squeezing each rep and taking the lats through their full range of motion for optimum effect.\n\nFinally, a perfect back workout will not forget the importance of corrective exercises for the back.  Here we want to be sure we work both the lumbar erectors and rotator cuff.  We can do both in one move using the Hyper Y/W combo shown in the video.  You will not need to use heavy weights to do this.  Light weights will still light you up in exactly the way you need to be for best effect.\n\nHere is how to construct the perfect back workout:\n\n1A. Deadlift x 10,8\n1B. Weighted Chin x 4RM, 8RM\n\n2A. Deadlift x 6,6\n2B. BW Wide Grip Pullups x F,F\n\n3. Barbell Dead Rows (12RM) - 2-3 x 8-10\n\n4. Alternating 1 Arm High Cable Row OR Rocking Pulldown - 2-3 x 10-12\n\n5. Hyper Y/W Combo - 2 x 14-20 (alternate Y/W each rep)\n\n6. Barbell Ladder Shrug Finisher - 1 x F\n\n\nWhen you put this together in the format as I’m suggesting here, you not only now hit the back through its full range of motion but you hit every function of the this multi muscle group posterior chain as well.  The supersets and ladders allow for an intensification of the workout to ensure that you are creating enough overload to spark growth in these muscles.\n\nThis is just one example of how to apply science to your back workouts.  If you want to train like an athlete you want to put science back in every workout you do.  You can do that with the ATHLEAN-X Training Programs available at the link below and get started right away on building a ripped, muscular, athletic body.\n\nFor more back workout videos that also hit the traps, low back and help to build bigger lats, be sure to subscribe to our channel here on youtube at the link below and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 5,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "eE7dzM0iexc"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/eE7dzM0iexc/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/eE7dzM0iexc/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/eE7dzM0iexc/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/eE7dzM0iexc/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/eE7dzM0iexc/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Back Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "RjexvOAsVtI",
                "videoPublishedAt": "2019-02-24T18:48:34Z"
            },
            "etag": "vC57PCeLXDX2u0ieN40kSvzjU1g",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC4wMTcyMDhGQUE4NTIzM0Y5",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect leg workout must consist of compound exercises for the quads, glutes and hamstrings while not overlooking the smaller muscles of the hips and our ability to train in all three planes.  In this leg workout, you will find that we overlook no component of upper leg training and get you training like an athlete in the process.\n\n60% off all AX programs - http://athleanx.com/x/33-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nAs with all videos in this perfect workout series, the goal here is to make sure you will build not only size by following these leg exercises but strength and explosiveness as well.  This starts as always with a compound movement for the legs, and there is none better than the squat.  While warming up to perform the squat the key is not to exhaust yourself more than necessary.  Too many times, people perform too many warmups, cutting into energy reserves for their working sets.\n\nWhat you should do instead, is do a few reps with your sub-working weight to loosen up your joints. Just before starting your first work set, perform one touch-up set with about 10 percent more than what you will be using for your workout.  Perform just 1 to 2 reps here to prepare the nervous system and neurologically “lighten” the load that is to come.\n\nWork your way from sets of 5 to a set of 25 grueling reps on the squats before moving onto the next component of this leg workout; the posterior chain compound exercise.\n\nHere you have two choices.  You can either do the barbell hip thrust or the glute ham raise.  Keep in mind, because you will be able to significantly load the barbell hip thrust more than you will the glute ham raise, you will want to opt for this exercise if your main goal is training for strength.  That said, if you are looking to get more active engagement of the hamstrings through their concentric range of motion, then you will want to do the GHR since it contributes in areas that the hip thrust only isometrically challenges.\n\nThe next exercise is the hi/low dumbbell bulgarian split squat.  This is a necessary component of any athletic lower body training approach because it is a unilateral exercise.  Not only do the dynamic stability benefits shine through here but it challenges the body in the frontal plane in ways that traditional bilateral training via squats cannot do.  Alternate the position of your torso on each rep to ensure you hit both the quads and the glutes more effectively on each rep.\n\nThe TKE Drop Lunge is a great way to ensure resistance through terminal knee extension.  Now, it is important that you understand that there is no way to isolate the medial or inner portion of the quads during an exercise.  What you can do however is ensure that this separately innervated head of the quads gets full stimulation by going to a full lockout position of extension on every rep.  We can overload that with the addition of the band as well.\n\nNext, no perfect leg workout would be complete without the additional focus on the inside and outside of our legs.  The adductors are hit tremendously well with the Goblet Adductor Lunge shown in this video.  Don’t just step back up to the top, but slide or squeeze your legs together to get yourself back to a standing position.  This will light up the all important adductor muscles on the inside of your thighs and help you to build the strength needed.\n\nFinally, you have to hit the outside abductors of your legs as well.  This can be accomplished with the finisher shown.  The hip band ladder requires that you work your way up to 10 reps in each direction of a side step while making sure to keep your toes pointed straight ahead at all times.  This will strengthen the outside of your legs, which is an area that tends to be very weak.\n\nFor the complete sets and reps of every exercise of this workout, be sure to check the end of the video where I include all of the information.  For more complete workouts that are laid out step by step and put the science back into training along the way, be sure to head to the link below and get the ATHLEAN-X Training Systems.  Start training like an athlete and start looking like one fast.\n\nFor more videos on how to build bigger legs and the best leg workouts without equipment, be sure to subscribe to this channel via the link below and turn on notifications so you never miss a new video when it’s published.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 6,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "RjexvOAsVtI"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/RjexvOAsVtI/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/RjexvOAsVtI/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/RjexvOAsVtI/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/RjexvOAsVtI/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/RjexvOAsVtI/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Leg Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "qk97w6ZmV90",
                "videoPublishedAt": "2019-06-30T16:35:36Z"
            },
            "etag": "95XHQUTFIxlbJkLX6ymXhyjqkx4",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC4yODlGNEE0NkRGMEEzMEQy",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect abs workout should consist of exercises for not just the six pack or rectus abdominis but other important muscles of the core as well.  That said, even that doesn’t make the ab workout complete.  In order to round out your midsection you will need to hit the obliques, transverse abdominis and serratus with a variety of carefully selected ab exercises to hit every function of the abs in the right sequence. That is what we do in this video.\n\n60% off all AX programs - http://athleanx.com/x/69-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nThe problem with ab focused training isn’t just that it trains simply a fraction of what the core muscles are capable of but also that many people choose the wrong exercises or ones that duplicate the same function.  For instance, if you look at the basic crunch, you will see that there are many different ways to perform it.  Most of them are just duplications of the same top down motion.  Putting too many of these too early in your ab workout is going to make it nearly impossible to perform the more difficult lower ab movements or rotational oblique exercises later on.\n\nYou see, there is a specific sequence of ab exercises that is going to give you the best chance of performing them with optimal energy.  You ideally want to start with movements that move the legs towards the rib cage.  The weight of the legs alone can be enough resistance to challenge the muscles of the abs (particularly if you are a beginner).  General fatigue from your ab workout is going to make it imperative that you start here.  Then, you want to incorporate rotation into these lower ab movements, followed by the rotationally driven oblique exercises.  Finish up your routine by transitioning to bottom and top half moving together (in our midrange movements) and then all top down and top down rotational exercises.  \n\nThe final piece of the puzzle is the serratus.  Many people will overlook this muscle as an important core muscle but it truly is.  Because of it’s role in stabilizing the trunk by keeping the shoulder blades in contact with the rib cage, they have an integral role working with the obliques.  Both control rotation.  The obliques controlling the rotation of the entire torso while the serratus are controlling the rotation of the scapula around the rib cage.\n\nThe other important element of a perfect ab workout is making sure that you hit each of the major functions of the abs and midsection muscles.  It’s not enough to just curl your trunk up as if you are doing a crunch.  The role of the abs is sometimes to prevent motion all together.  In this perfect ab workout, there will be anti-rotational exercises as well as anti-lateral and anti-extension movements.\n\nAs you make your way through the workout however you also don’t want to miss the chance to train explosively.  When you train like an athlete you always want to speed up what you slow down with your heavier weight training. The sledgehammer swing is a perfect example of this at the advanced level.  Perform this powerful ground based ab exercise explosively and you will learn to use your lower body to generate force that your core has to command.\n\nHere is how to construct the perfect abs workout for beginners:\n\n1. ISO Reverse Crunches x 30-60 seconds\n2. Seated Ab Circles x 30-60 seconds (alternate cw and ccw directions)\nREST 30 SECONDS\n3. Recliner Elbow to Knee Tucks x 30-60 seconds \n4. Opposite Side Tuck Planks x 30-60 seconds\nREST 30 SECONDS\n5. Oak Tree Stepouts x 30-60 seconds each side\n6. Banded Pulldowns x 30-60 seconds\n7. Plank Pushaways x 30-60 seconds\n\nHere is how to construct the perfect abs workout for more advanced lifters:\n\n1. Hanging ‘X’ Raises x 30-60 seconds\n2. Hanging Leg Spirals x 30-60 seconds (alternate right and left twists)\nREST 20 SECONDS\n3. Tornado Chops x 30-60 seconds (alternate right and left chops)\n4. Opposite Scissor V Us x 30-60 seconds\nREST 20 SECONDS\n5. Sledgehammer Swings x 30-60 seconds each side\n6. Banded Pulldowns x 30-60 seconds\n7. Plank Punchouts x 30-60 seconds\n\n\nWhen you put this together in the format as I’m suggesting here, you not only now hit the abs through their full functions but you hit them in the best sequence to ensure your success.\n\nThis is just one example of how to apply science to your ab workouts.  If you want to train like an athlete you want to put science back in every workout you do.  You can do that with the ATHLEAN-X Training Programs available at the link below and get started right away on building a ripped, muscular, athletic body.\n\nFor more ab workout videos that also hit the obliques, love handles and six pack, be sure to subscribe to our channel here on youtube at the link below and don’t forget to turn on notifications so you never miss one.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 7,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "qk97w6ZmV90"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/qk97w6ZmV90/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/qk97w6ZmV90/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/qk97w6ZmV90/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/qk97w6ZmV90/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/qk97w6ZmV90/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Abs Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "R6gZoAzAhCg",
                "videoPublishedAt": "2019-07-28T15:58:53Z"
            },
            "etag": "URmVYKmfUA4YzjRg6vJhSwm2Y84",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC41NkI0NEY2RDEwNTU3Q0M2",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "Constructing a single perfect total body workout is a challenge when you consider all of the muscle groups that you will need to hit in that workout.  That said, I’m going to deliver exactly that in this video.  If you want to try just a single total body workout routine if you are new to this type of training, then you will want to do the A workout.  If instead, you want to adopt a more rigorous total body split workout routine, then you will want to pair this up with the B workout and perform them in alternating fashion on Monday, Wednesday and Friday.\n\n60% off all AX programs - http://athleanx.com/x/76-workouts\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nFirst, it helps to discuss the benefits of total body workouts.  This type of workout split allows you to train the bigger muscles of the body utilizing the more compound exercises.  These are the exercises that lend themselves to increased strength at a faster pace and also help to coordinate multiple muscle groups into one action, making them more athletically based and functional.\n\nGiven the fact that science will support the fact that stimulation and re-stimulation of a muscle every 48 hours produces the most amount of muscle growth with the least amount of wasted time, you will find that total body workouts take advantage of this.  By allowing you to train your entire body every other day you are getting more frequent stimuli for protein synthesis, more accrued volume and more sessions in over a given period of time.\n\nIn this total body split, we focus not just on picking the compound exercises but rather on accomplishing specific movements.  We want to perform a lunge, hinge and squat for the lower body; a push and pull for the upper body; and a corrective and carry to round out our workouts.  The combination of these 7 components will not only hit all of the major functions of human performance but will lend themselves to picking the right exercises for getting the job done.\n\nThat said, let’s start breaking down the workouts.\n\nHere is how to construct the perfect total body workout A:\n\n1. 3D Lunge Warmup - 2-3 x 7 reps each direction\n2. Barbell Squats - 3 x 5\n3. Barbell Hip Thrusts - 3-4 x 10-12\n4. Barbell Bench Press - 3 x 5\n5. Weighted Chin Ups - 3 x 6-10 to failure\n6. DB Farmer’s Carries - 3-4 x 50 steps with half bodyweight\n7. Face Pulls - 2 x 12 (using 12 sets of 1 mentality)\n\nHere is how to construct the perfect total body workout B:\n\n1. 3D Lunge Warmup - 2-3 x 7 reps each direction\n2. Deadlifts - 3 x 5\n3. Barbell Squats or Barbell Reverse Lunges - 3-4 x 10\n4. Barbell OHP - 3 x 5\n5. Barbell Rows - 3 x 10-12\n6. DB Overhead Farmer’s Carries - 3-4 x 50 steps with one quarter bodyweight\n7. Face Pulls or other corrective - 2 x 12 (using 12 sets of 1 mentality)\n\nIf you are doing this workout just to try it out, then I would suggest you choose the workout A variation. That said, if you opt to do a more comprehensive total body split workout routine then you will want to either incorporate workouts A and B into a twice a week plan or, even better, alternating A and B on M, W and F each week.\n\nOther total body splits exist as well.  These include doing a complete push (including both upper and lower body) and pull that simply gets alternated six days a week.  There is also the most comprehensive and effective of all and that is the TOTAL BEAXST program that I created and provide on our website at http://athleanx.com. This plan is designed to not just build as much muscle as possible in 90 days but also help to build your athleticism and prevent unwanted injury that occurs often with other total body workouts.\n\nIf you’re looking to become a beast with a step by step plan based on total body split training, then head to the site via the link below and get ready to let the gains begin.\n\nFor more videos on how to design the perfect workout program and workout split as well as other complete total body workout routines, be sure to subscribe to our channel on youtube at the link below and turn on your notifications so you never miss a new video when it’s published.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 8,
                "publishedAt": "2019-08-08T21:01:36Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "R6gZoAzAhCg"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/R6gZoAzAhCg/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/R6gZoAzAhCg/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/R6gZoAzAhCg/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/R6gZoAzAhCg/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/R6gZoAzAhCg/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Total Body Workout (Sets and Reps Included)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "HE45jVN7XKM",
                "videoPublishedAt": "2021-05-10T16:06:48Z"
            },
            "etag": "TISV7pqM7DPNIEPQHN3D0PTU1Vo",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC5GNjNDRDREMDQxOThCMDQ2",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "The perfect push workout is a component of a push, pull, legs workout split which is one of the most common training splits for building muscle and strength. In this video, I’m continuing the perfect workout series and bringing you the perfect push workout to build a bigger chest, shoulders, and triceps. Not only am I going to provide the exercises, but I’m breaking down all the sets and reps to make sure you don’t miss out on any muscle gains.\n\n60% off all AX programs - http://athleanx.com/x/227-workouts\nSubscribe to this channel here - http://bit.ly/2b0coMW\n\nA PPL split is a pull, push, and legs workout program that can be laid out a few different ways, but I’m showing you my favorite. One thing to note is how to sequence this training split; repeating each workout day twice in sequence for 6 straight workout days in a row before a rest day. This option allows for a predictable schedule but compromises rest in the process.\n\nThe other way to perform a PPL split is take a rest day after the first 3 workouts. Perform another 3 days and then rest once again. This asynchronous split causes unpredictable rest days, but allows for more recovery which leads to overall better muscle gains.\n\nBelow is Push Workout 1:\n\n- Bench Press - 4 x 4-6 (leave 1-2 in the tank)\n- Hi-to-Low Crossover - 3 x 10-12 (post-pressing adduction)\n- DB Shoulder Press - 4 x 8-10 (standing movement)\n- 1.5 Side Lateral Raises - 3 x 12-15 (direct side delt activation)\n- Lying Triceps Extensions 3 x 10-12 into DB Waiter Curls - 3 x 10-12\n- Rotator Cuff ER - 3 x 15-20 (rotator cuff strengthening and shoulder stability / health)\n\nWith any push workout, it is essential to include a heavy compound movement and in this case, it’s the classic bench press. This particular exercises allows for overload on all 3 major pushing muscles, the chest, triceps, and shoulders together. With 4 sets of 4-6 reps, make sure to choose a weight where you can perform in the given rep range with 1-2 reps left in the tank.\n\nNext in this push day is the hi-to-low crossover. This exercise provides adduction of the chest that most pressing movements do not as they don’t allow for the arms to travel across the midline of the chest. Taking the chest through its full range of motion is necessary to get a bigger chest in the long run.\n\nThe DB shoulder press is performed standing instead of sitting because pressing your back in the bench while pressing overhead interferes with scapular movement. The utilization of dumbbells in this particular workout not only allows for the bench press to be the compound exercise of choice, but it also helps to expose any imbalances one might have.\n\nThe 1.5 side lateral raises allow for direct side delt activation that is ignored in the previous exercises of this perfect push workout, all of which are heavily influencing the front delts. This direct focus on the side delts will help to build overall bigger shoulders.\n\nAs we did in the Perfect Pull Workout, we are including both triceps and biceps as a superset here in our push workout. The arms get targeted with a superset with the lying triceps extensions into a DB waiter’s curl. Including both biceps and triceps on a push day accrues for extra volume that is necessary for building muscle.\n\nTo finish up this push workout, I included the banded rotator cuff external rotation as our corrective for the day. It is a phenomenal way to build shoulder health and stability, something necessary for any effective push day workout as well as promoting general shoulder health and safety.\n\nHere is what Push Workout 2 looks like:\n\n- Barbell Overhead Press - 4 x 4-6 (leave 1-2 in the tank)\n- Underhand DB Bench Press - 3 x 8-10\n- Abduction Rows - 3 x 10-12\n- Floor Flys - 3 x 10-12\n- Triceps Close Grip Bench Press - 3 x 6-8 into DB Curl of Choice - 3 x 10-12\n- Pushup Plus - 3 x F\n\nUtilizing both of these workouts will serve as your push workout in the PPL workout split. Alternate these two workouts whenever the push day of the PPL split shows up on the calendar. Remember to select weight that will allow for failure in the prescribed rep ranges, aiming to add more weight each time the workout appears.\n\nLooking for a step by step push pull legs workout split that can help you to build ripped, athletic muscle with a meal plan included? If so, be sure to visit athleanx.com using the link below and check out the AX-1 training program.\n\nFor more videos on how to build muscle and strength with a push pull legs workout split, be sure to subscribe to our channel via the link below and don’t forget to turn on your notifications so you never miss a new video when one comes out.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 9,
                "publishedAt": "2021-05-10T16:01:33Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "HE45jVN7XKM"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/HE45jVN7XKM/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/HE45jVN7XKM/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/HE45jVN7XKM/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/HE45jVN7XKM/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/HE45jVN7XKM/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Push Workout (PUSH | PULL | LEGS)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "u6GVYTsxEhw",
                "videoPublishedAt": "2021-06-03T17:28:24Z"
            },
            "etag": "eT96f5nBI5QvAwppSGhuFcsE8gM",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC40NzZCMERDMjVEN0RFRThB",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "If you want to lose love handles then you better start doing an obliques workout so you can be sure they look good when you drop the excess body fat. In this video, I’m going to show you the perfect obliques workout that you can do at home with no equipment at all. That said, since we know that body fat accumulation over this area can lead to the dreaded love handles, I’m going to point you to some nutritional guidance as well that will help you to lose weight and show off those obliques as you develop them.\n\n60% off all AX programs - http://athleanx.com/x/233-workouts\nSubscribe to this channel here - http://bit.ly/2b0coMW\n\nIn terms of the workout, it helps to first understand a bit of the anatomy of the oblique muscles in order to get the most out of your training and to lose love handles fast.\n\nThe obliques are composed of both internal obliques and external obliques. As implied, the internal run deeper than the external and are actually not visible to the naked eye from the outside. The direction of the fibers run perpendicular to each other with the external obliques running down and in and the internal obliques running up and in.\n\nTo really have a complete obliques workout you need to make sure that you train both of these muscles and that you hit all of the functions of these muscles in one concise training plan. The roles of the oblique muscles are not just to make your love handles look better when covered by less fat but to do many different actions. These include, rotation both from the top down and the bottom up. Side flexion from the top down and the bottom up, and prevention of both rotation and side bending.\n\nTo structure this perfect obliques workout we ask that you attempt to do each of the movements for up to 45 seconds if able. Take a 15 second rest at the end of each exercise. If you can only do any of the oblique exercises for less than 45 seconds, simply rest pause your way until the time has elapsed.\n\nThe specific exercises in the workout are as follows:\n\nBottom Up Rotation - Archer Tucks x 45 seconds / 15 second rest\nTop Down Rotation - Russian Twists x 45 seconds / 15 second rest\nBottom Up Lateral Flexion - Side Plank Bridge Twists x 45 seconds each side / 15 second rest\nTop Down lateral flexion right - Side Cycle Crunch (Band Elbow Thrusts Option) x 45 seconds\nAnti-lateral Flexion - Side Plank Walk Throughs x 45 seconds each side / 15 seconds rest\nAnti-Rotation - Wall Locks (Oak Tree Step Outs Option) x 45 seconds each side / 15 seconds rest\n\nThe key to any oblique workout is getting good quality contractions. \n\nYou never want to rush your way through any of the oblique exercises that you are doing. It’s not the number of reps that you are doing in any of these workouts but the intensity of the contraction and how well you are feeling the muscle working. This means, that even if you have to go slower in order to really feel a squeeze in the right or left sides, do it. \n\nThis can be done in addition to whatever ab workout you may be doing at the moment. Just remember to remove whatever exercises for obliques you may be doing in that workout since you won’t need to double up. The amount of volume here is appropriate to get those obliques of yours looking way better and to get rid of the love handles once and for all.\n\nRegarding the loss of the love handles or the fat that lays over the top of these muscles? Be sure to visit the link mentioned in the video. It is critical that you get your body fat levels down to around 10-12% if you want to see your best oblique muscle definition. This can only be accomplished by following a sensible meal plan that helps you to get into a hypo caloric state where burning off excess fat is achievable. \n\nIf you are looking for a complete step by step nutrition plan to go along with this perfect obliques workout, be sure to visit athleanx.com via the link below. See how easy it is to lose fat and build muscle at the same time by training like an athlete with our day by day meal plans and workouts.\n\nFor more oblique exercises and workouts for obliques, be sure to subscribe to our youtube channel via the link below and remember to turn on your notifications so you never miss a new video when it’s published.",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 10,
                "publishedAt": "2021-06-03T19:44:32Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "u6GVYTsxEhw"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/u6GVYTsxEhw/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/u6GVYTsxEhw/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/u6GVYTsxEhw/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/u6GVYTsxEhw/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/u6GVYTsxEhw/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Obliques Workout (LOSE LOVE HANDLES!)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        },
        {
            "contentDetails": {
                "videoId": "zoKu5Bw9rLU",
                "videoPublishedAt": "2023-11-06T18:52:56Z"
            },
            "etag": "zfoosFW3t0AziC_beZcVEF2JaYA",
            "id": "UExSUzJERTRQMzlFZEFfZ3R4MzJOTDJXZUl1Xzk0cnpxdC5EMEEwRUY5M0RDRTU3NDJC",
            "kind": "youtube#playlistItem",
            "snippet": {
                "channelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "channelTitle": "ATHLEAN-X™",
                "description": "To build a perfect chest as a beginner you need a perfect chest workout that you can follow. In this video, I’m laying out the best chest workout for beginners that can be done from home and with minimal equipment and space required. All you need to do is bring the effort and motivation to work hard and the workout will take care of the rest.\n\nLet’s break down what is involved in this perfect chest workout first and then we can start to run through the exercises.\n\nThis home chest workout for beginners incorporates 5 exercises - 4 that target the chest muscles and one corrective exercise that hits the rotator cuff muscles and is protective of your shoulder joint. Many people forget to do exercises that compliment their chest exercises which leads to imbalances at best and injuries to their shoulders at worst. As a physical therapist, I want to lay down a foundation without cracks especially when constructing a chest workout for beginners.\n\nAll five of the exercises in this chest workout are going to be performed in order, with the sequence of upper chest exericse, middle chest exercise and lower chest exercise being the preferred order you do them. Rest time should be kept to a minimum when moving from one beginner chest exercise to the next.\n\nWhen given a rep range, you want to try and fail within that range. If it is on one of the banded chest exercises then you will adjust the resistance accordingly to match your ability to fail within the stated range. If it is on one of the pushup variations, then slow the tempo down and focus on a strong chest contraction on every rep to increase the effectiveness and decrease the reps to get you within range.\n\nRepeat the entire chest workout for beginners 2-3 times per workout.\n\nHere is what it looks like:\n\n1.  PROWLER PUSHUPS x F (OPTIONAL - BANDED INCLINE SPLIT x 10-20 F Each Side)\n\r2.  HAND RELEASE PUSHUPS x F\n\r3.  PSEUDO PLANCHE PUSHUPS x F\r\n4.  BANDED SAWS x F each side (8-15 RM Tension)\n\r5.  BANDED EXTERNAL ROTATION x 12-15 each arm\n\nIt starts with our pushup that targets the upper chest called the prowler pushup. The key here is that you are pushhing your arms up and away from your body, in line with the direction of the upper chest fibers .Take your set to failure within the 10-20 rep range. If you want to do an alternative upper chest exercise you can do the banded chest exercise shown in the video.\n\nThe second exercise targets the sternal head of the pectoralis major. This is different than a standard pushup however as it incorporates the all important hand release before every rep. This forces good form on the pushups since it avoids the common pushup mistakes of poor body posture that are common for beginners. This also teaches you to incorporate your back muscles prior to pressing which is essential to learn for later when you perform a barbell bench press.\n\nThe third exercise is going to target the abdominal head of the pecs or lower chest. This pseudo planche pushup simulates a dip in the downward direction the arms will move during the pushup. The shoulders and triceps will be included in the exercise much like they are on a dip, but that is good and something that you will need at this point in the chest workout circuit.\n\nNext is the adduction function of a complete chest contraction. \n\nWe can do this with an exercise called the banded saw. Think not about doing a crossover but instead running the arm paralell to the floor, straight across your chest. Hold each contraction for 1-2 seconds at the top to develop a good mind muscle connection with your pecs that will serve you now and for the rest of your training life.\n\nFinally, the corrective exercise mentioned earlier is critical for protecting your shoulder from the imbalances that can often occur with chest workouts. This one targets the external rotation function of the shoulder with the use of a simple band. Perform 12-15 reps of high quality focused contractions.\n \nFor more perfect workouts, be sure to subscribe to our channel here on youtube via the link below and remember to turn on your notifications so you never miss a video when it’s published.\n\nFor a complete chest workout as well as total body programs and meal plans be sure to head to athleanx.com and use our program selector tool to find the program that best matches your goals.\n\nGet a Perfect Chest - http://athleanx.com/x/perfect-beginner-chest\nSubscribe to this channel here - http://youtube.com/user/jdcav24\n\nJeff Cavaliere MSPT, CSCS served as both the head physical therapist and assistant strength coach for the New York Mets. Jeff earned his Masters of Physical Therapy and Bachelor’s of Physioneurobiology from the College of Health Sciences University of Connecticut Storrs. He is a certified Strength and Conditioning Specialist by the National Strength and Conditioning Association (NSCA).",
                "playlistId": "PLRS2DE4P39EdA_gtx32NL2WeIu_94rzqt",
                "position": 11,
                "publishedAt": "2023-11-06T18:36:47Z",
                "resourceId": {
                    "kind": "youtube#video",
                    "videoId": "zoKu5Bw9rLU"
                },
                "thumbnails": {
                    "default": {
                        "height": 90,
                        "url": "https://i.ytimg.com/vi/zoKu5Bw9rLU/default.jpg",
                        "width": 120
                    },
                    "high": {
                        "height": 360,
                        "url": "https://i.ytimg.com/vi/zoKu5Bw9rLU/hqdefault.jpg",
                        "width": 480
                    },
                    "maxres": {
                        "height": 720,
                        "url": "https://i.ytimg.com/vi/zoKu5Bw9rLU/maxresdefault.jpg",
                        "width": 1280
                    },
                    "medium": {
                        "height": 180,
                        "url": "https://i.ytimg.com/vi/zoKu5Bw9rLU/mqdefault.jpg",
                        "width": 320
                    },
                    "standard": {
                        "height": 480,
                        "url": "https://i.ytimg.com/vi/zoKu5Bw9rLU/sddefault.jpg",
                        "width": 640
                    }
                },
                "title": "The PERFECT Chest Workout for Beginners (HOME EDITION)",
                "videoOwnerChannelId": "UCe0TLA0EsQbE-MjuHXevj2A",
                "videoOwnerChannelTitle": "ATHLEAN-X™"
            }
        }
    ],
    "kind": "youtube#playlistItemListResponse",
    "pageInfo": {
        "resultsPerPage": 30,
        "totalResults": 12
    }
}